public class lesson_19_23 {
    //Нововведения в Java 8: Функциональное программирование

    //Вместе с выходом Java 8 в ней появилась мощная поддержка функционального программирования.
    //Можно даже сказать, долгожданная поддержка функционального программирования.
    //Код стал писаться быстрее, хотя читать его стало сложнее

    //Перед изучением функционального программирования в Java, рекомендуем хорошо разобраться в трех вещах:
    //ООП, наследование и интерфейсы (1-2 уровни квеста Java Core).
    //Дефолтная реализация методов в интерфейсе.
    //Внутренние и анонимные классы.

    //Хорошая новость заключается в том,
    //что без знания всего этого можно пользоваться многими возможностями функционального программирования в Java.
    //Плохая новость — понять, как именно все устроено и как все работает, без тех же внутренних анонимных классов уже сложно.

    //В ближайших лекциях мы сосредоточимся на том,
    //как легко и просто пользоваться возможностями функционального программирования в Java,
    //без глубокого понимания, как оно устроено.

    //Чтобы разобраться во всех нюансах функционального программирования в Java, нужны месяцы.
    //Читать же такой код можно научиться за несколько часов.
    //Поэтому предлагаем начать с малого. Да хоть с тех же потоков ввода-вывода.
}

